Repository: ingoreuter/css_page
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# tx_csspage.plugin.name
source: Render body CSS code (do NOT include as content element)
de: Body-CSS ausgeben (NICHT als Inhaltselement einfügen!)

# tx_csspage.be.tabname
source: Pagestyle
de: Seitendesign

# tx_csspage.flex.tab.backgroundimage
source: Background image
de: Hintergrundbild

# tx_csspage.flex.backgroundimage
source: Background image
de: Hintergrundbild

# tx_csspage.flex.backgroundrepeat
source: Background repeat
de: Wiederholung des Hintergrundbildes

# tx_csspage.flex.backgroundrepeat.items.noRepeat
source: Do not repeat background image
de: Hintergrundbild NICHT wiederholen

# tx_csspage.flex.backgroundrepeat.items.repeatX
source: Repeat horizontal
de: Horizontal wiederholen

# tx_csspage.flex.backgroundrepeat.items.repeatY
source: Repeat vertical
de: Vertikal wiederholen

# tx_csspage.flex.backgroundrepeat.items.repeatXY
source: Repeat horizontal and vertical
de: Horizontal und vertikal wiederholen

# tx_csspage.flex.backgroundattachment
source: Background attachment (behavior on scrolling)
de: Background attachment (verhalten beim Scrollen)

# tx_csspage.flex.backgroundattachment.items.scroll
source: Scroll along with the element
de: Mit dem Element bewegen

# tx_csspage.flex.backgroundattachment.items.fixed
source: Fixed with regard to the viewport
de: Feste Position im Browserfenster

# tx_csspage.flex.backgroundattachment.items.local
source: Scroll along with the element's contents
de: Mit dem Inhalt des Elements bewegen

# tx_csspage.flex.backgroundorigin
source: Area where the background is shown
de: Bereich, in dem der Hintergrund dargesetllt werden soll

# tx_csspage.flex.backgroundorigin.items.padding
source: Show on padding-box
de: In der Padding-Box darstellen

# tx_csspage.flex.backgroundorigin.items.border
source: Show on border-box
de: In der Rahmen-Box darstellen

# tx_csspage.flex.backgroundorigin.items.content
source: Show on content-box
de: In der Inhalts-Box darstellen

# tx_csspage.flex.backgroundposition
source: Background position \n\n (You can set the x and y position to "center", "top", "left", "right" and "bottom". Alternatively you can set values to percent (%) and pixel (px). The top left corner is (0|0). If only one value is provided, the other one will be taken as center / 50%.)
de: Position des Hintergrundbildes \n \n (Die X- und Y-Position durch CSS-definierte Ausdrücke wie "center", "top", "left", "right" oder "left" festgelegt werden. Alternativ kann die Definition über Prozentwerte (%) oder Pixelwerte (px) erfolgen. Die obere, linke Ecke ist bei (0|0). Wenn nur ein Wert angegeben wird, wird der fehlende auf "center" bzw. 50% gesetzt.

# tx_csspage.flex.backgroundsize
source: Background size \n\n You can use two numeric values (units: px, %, ...) (e.g. "20px 40px") to set the width and height (secound value). If only one values is provided, the hight is set to "auto" to keep the image's aspect ratio. Alternatively you can use "auto" (devault value, if empty) to keep the image's original size. "cover" scales the backgroundimage to cover the full page. "contain" scales the background to it's largest possible size that the full image is visible. "inherit" applies the value the parent element.
de: Größe des Hintergrundbildes \n \n Es können zwei numerische Werte (Einheinten: px, %, ...) (z.B. "20px 40px") angegenben werden, um die Breite und Höhe (zweiter Wert) zu definieren. Wenn nur ein Wert angegeben wird, wird die Höhe auf "auto" gesetzt, um das Seitenverhältnis des Bildes beizubehalten. Alternativ kann "auto" (Standardwert) genutzt werden, um die Originalgröße des Bildes beizubehalten. "cover" skaliert das Bild so, dass das gesamte Inhaltselement ausgefüllt ist. "contain" skaliert das Hintergrundbild so, dass es in maximal möglicher Größe komplett sichtbar ist. "inherit" vererbt den Wert des übergeordneten Elements.

# tx_csspage.flex.tab.backgroundcolor
source: Background color
de: Hintergrundfarbe

# tx_csspage.flex.backgroundcolor
source: Background color \n\n You can use a HTML-value (like "#3399DD"), an RGB(A)-Valure (use: "rgb(10,0,90)" or "rgba(255, 0, 0, 0.25)) or an CSS-Keyword (like "red").
de: Hintergundfarbe \n \n Es können HTML-Werte (z.B. "#3399DD"), ein RGB(A)-Wert (z.B. "rgb(10,0,90)" oder "rgba(255, 0 ,0 , 0.25)") oder ein CSS-Farbname (wie "red") genutzt werden

# tx_csspage.flex.backgroundclip
source: Area where the background color is shown
de: Bereich, in dem die Hintergrundfarbe dargestellt wird

# tx_csspage.flex.backgroundclip.items.padding
source: Show on padding-box
de: In der Padding-Box anzeigen

# tx_csspage.flex.backgroundclip.items.border
source: Show on border-box
de: In der Rahemn-Box darstellen

# tx_csspage.flex.backgroundclip.items.content
source: Show on content-box
de: In der Inhalts-Box darstellen

# tx_csspage.flex.tab.other
source: Advanced CSS configuration
de: Erweiterte CSS-Konfiguration

# tx_csspage.flex.bodyCss
source: Advanced body configuration \n\n Set more CSS properties to the body tag. Just write standart CSS code. Do NOT write "body{" and the closing "}". This is done for you ;)
de: Erweiterte BODY-Konfiguration \n \n Weitere CSS-Eigenschaften für den BODY-Tag. Standart CSS-Code - ohne einführung von "body {" und Klammer am Ende "}". Diese werden automatisch erzeugt ;)

# tx_csspage.flex.pageCss
source: Advanced page configuration \n\n Set more CSS properties to a feely choosen element. Just write standart CSS code. Do not forget to adress the element by using selectors (like "#myElement { font-size: 2em; }")
de: Erweiterte Seiten-Konfiguration \n \n Definiert CSS-Eigenschaften für ein frei gewähltes Element. Normaler CSS-Code. Hier müssen selektoren (z.B. "#myElement{ font-size: 2em}") gesezt werden!

# tx_csspage.flex.stdItems.notSet
source: [Not set / use default]
de: [Nicht definiert / Standardwert nutzen]

# tx_csspage.flex.stdItems.cssValues
source: CSS values
de: CSS-Werte

# tx_csspage.flex.stdItems.div.dynamic
source: Dynamic values
de: Dynamische Werte

# tx_csspage.flex.stdItems.inherit
source: Inherit property from its parent element
de: Vererbte Eigenschaft von übergeordnetem Element
